results/factorial/plaintext-requested-full-broker5/plaintext-requested-full-factorial-b5-rf3-isr3-msg1024-tps1000-batch131072-acks1-prod6-compnone-trial1/producer-perf-6.log
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=166
830 records sent, 165.8 records/sec (0.16 MB/sec), 136.3 ms avg latency, 3610.0 ms max latency.
833 records sent, 166.4 records/sec (0.16 MB/sec), 8.3 ms avg latency, 49.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.2 ms avg latency, 17.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.6 ms avg latency, 16.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.3 ms avg latency, 19.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.1 ms avg latency, 13.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.7 ms avg latency, 11.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.2 ms avg latency, 11.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.2 ms avg latency, 18.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 6.1 ms avg latency, 12.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.0 ms avg latency, 14.0 ms max latency.
830 records sent, 166.0 records/sec (0.16 MB/sec), 5.9 ms avg latency, 10.0 ms max latency.
830 records sent, 166.0 records/sec (0.16 MB/sec), 5.9 ms avg latency, 12.0 ms max latency.
832 records sent, 166.2 records/sec (0.16 MB/sec), 5.9 ms avg latency, 13.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 5.9 ms avg latency, 16.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 5.9 ms avg latency, 11.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 5.9 ms avg latency, 12.0 ms max latency.
830 records sent, 166.0 records/sec (0.16 MB/sec), 5.9 ms avg latency, 9.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 5.9 ms avg latency, 14.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 6.0 ms avg latency, 13.0 ms max latency.
16666 records sent, 165.964608 records/sec (0.16 MB/sec), 12.88 ms avg latency, 3610.00 ms max latency, 6 ms 50th, 13 ms 95th, 205 ms 99th, 288 ms 99.9th.